Revit 2024 API
ExternalDefinitionCreationOptions.Visible Property
 True if the parameter is visible to the user, false if it is hidden and accessible only via the API. The default is true.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool Visible { get; set; }
Visual Basic
Public Property Visible As Boolean
	Get
	Set
Visual C++
public:
property bool Visible {
	bool get ();
	void set (bool value);
}
See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace